app/views/comments/_comment.html.erb

    <p>
        <strong>Posted <%= time_ago_in_words(comment.created_at) %></strong><br />
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Added using ajax!"], ["created_at", "2014-09-18 23:05:38.878925"], ["post_id", 1], ["updated_at", "2014-09-18 23:05:38.878925"]]